**==================== Pandas ====================**

In [1]:
import numpy as np
import pandas as pd

**Series**

In [2]:
ls = pd.Series()
ls

Series([], dtype: object)

In [3]:
data = np.array(["a", "b", "c", "d"])

ls = pd.Series(data)
ls

0    a
1    b
2    c
3    d
dtype: object

In [4]:
data = [11, 3, 26]

ls = pd.Series(data)
ls

0    11
1     3
2    26
dtype: int64

In [5]:
calories = {"day1": 420,
            "day2": 380,
            "day3": 390
           }

ls = pd.Series(calories)
ls

day1    420
day2    380
day3    390
dtype: int64

**Dataframe**

In [6]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [7]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [8]:
data = [75, 23, 4, 6, 19]

df = pd.DataFrame(data)
df

    0
0  75
1  23
2   4
3   6
4  19

In [9]:
print(df)

    0
0  75
1  23
2   4
3   6
4  19

In [10]:
data = {"Name": ["Tom", "Jack", "Steve", "Ricky"],
        "Age": [28, 34, 29, 42]}

df = pd.DataFrame(data, index=["rank1", "rank2", "rank3", "rank4"])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [11]:
data = [{"a": 1, "b": 2},
        {"a": 5, "b": 10, "c": 20}]

df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [12]:
df.loc[0]

a    1.0
b    2.0
c    NaN
Name: 0, dtype: float64

In [13]:
df.loc[1]

a     5.0
b    10.0
c    20.0
Name: 1, dtype: float64

**==================== Pandas - Descriptive Statistics ====================**

In [14]:
data = {"Name":pd.Series(["Tom", "James", "Ricky", "Vin", "Steve", "Smith", "Jack", "Lee", "David", "Gasper", "Betina", "Andres"]),
        "Age":pd.Series([25, 26, 25, 23, 30, 29, 23, 34, 40, 30, 51, 46]),
        "Rating":pd.Series([4.23, 3.24, 3.98, 2.56, 3.20, 4.6, 3.8, 3.78, 2.98, 4.80, 4.10, 3.65])}

df = pd.DataFrame(data)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [15]:
df.sum()

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [16]:
df[["Age", "Rating"]].sum()

Age       382.00
Rating     44.92
dtype: float64

In [17]:
df[["Age", "Rating"]].mean()

Age       31.833333
Rating     3.743333
dtype: float64

In [18]:
df[["Age", "Rating"]].mode()

     Age  Rating
0   23.0    2.56
1   25.0    2.98
2   30.0    3.20
3    NaN    3.24
4    NaN    3.65
5    NaN    3.78
6    NaN    3.80
7    NaN    3.98
8    NaN    4.10
9    NaN    4.23
10   NaN    4.60
11   NaN    4.80

In [19]:
df[["Age", "Rating"]].median()

Age       29.50
Rating     3.79
dtype: float64

In [20]:
df[["Age", "Rating"]].std()

Age       9.232682
Rating    0.661628
dtype: float64

In [21]:
df[["Age", "Rating"]].max()

Age       51.0
Rating     4.8
dtype: float64

In [22]:
df[["Age", "Rating"]].min()

Age       23.00
Rating     2.56
dtype: float64

In [23]:
df[["Age", "Rating"]].describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [24]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000